
Процедура ОбработкаПроведения(Отказ, РежимПроведения)        
	
	Движения.ОстаткиТоваров.Записывать = Истина;    
	Движения.Записать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	СУММА(ПродажаТовараСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараСписокТоваров.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Товар КАК Товар,
		|	ВТ_ТЧ.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВТ_ТЧ.Товар.Представление КАК ТоварПредставление
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Товар В
		|					(ВЫБРАТЬ
		|						ВТ_ТЧ.Товар КАК Товар
		|					ИЗ
		|						ВТ_ТЧ КАК ВТ_ТЧ)) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_ТЧ.Товар = ОстаткиТоваровОстатки.Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
		
		Если  ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не хватает товара %1 в количестве %2 шт.",
			                    ВыборкаДетальныеЗаписи.ТоварПредставление,
						ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток);	 
			Сообщение.Сообщить();
			
		КонецЕсли;   
		
		Если Отказ = Истина Тогда 
			
			Продолжить;
			
		КонецЕсли;
			
		Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Период = Дата;
		Движение.Товар = ВыборкаДетальныеЗаписи.Товар;
		
	КонецЦикла;

	
КонецПроцедуры
